In [1]:
import numpy as np
import pandas as pd

In [3]:
s = pd.Series(np.random.randn(5),index = ['a', 'b', 'c', 'd', 'e'] )

In [4]:
s

a    0.748135
b    0.953865
c   -1.482175
d    0.559543
e   -0.423715
dtype: float64

In [5]:
s.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [6]:
pd.Series(np.random.randn(5))

0    0.817667
1   -0.923739
2   -0.426098
3    0.802392
4   -0.811346
dtype: float64

In [8]:
d = {'b':1, 'a':0, 'c':2}
pd.Series(d)

b    1
a    0
c    2
dtype: int64

In [9]:
pd.Series(5., index =['a', 'b', 'c', 'd', 'e'] )

a    5.0
b    5.0
c    5.0
d    5.0
e    5.0
dtype: float64

In [10]:
s[0]

0.7481346291608499

In [11]:
s[:3]

a    0.748135
b    0.953865
c   -1.482175
dtype: float64

In [12]:
s[s>s.median()]

a    0.748135
b    0.953865
dtype: float64

In [14]:
s[[4,3,1]]

e   -0.423715
d    0.559543
b    0.953865
dtype: float64

In [15]:
np.exp(s)

a    2.113055
b    2.595722
c    0.227143
d    1.749873
e    0.654611
dtype: float64

In [16]:
s.dtype

dtype('float64')

In [17]:
s.to_numpy()

array([ 0.74813463,  0.95386452, -1.48217526,  0.55954299, -0.42371481])

In [18]:
s['a']

0.7481346291608499

In [19]:
'e' in s

True

In [20]:
s + s

a    1.496269
b    1.907729
c   -2.964351
d    1.119086
e   -0.847430
dtype: float64

In [21]:
s = pd.Series(np.random.randn(5), name = 'something')

In [22]:
s

0   -0.422300
1   -0.223895
2    0.360736
3   -0.538217
4    1.257113
Name: something, dtype: float64

In [23]:
s.name

'something'

In [24]:
d = {'one':pd.Series([1,2,3], index=['a','b','c']),'two':pd.Series([1.,2.,3.,4.],index=['a','b','c','d'])}

In [25]:
df = pd.DataFrame(d)

In [26]:
df

   one  two
a  1.0  1.0
b  2.0  2.0
c  3.0  3.0
d  NaN  4.0

In [28]:
pd.DataFrame(d,index=['d','b','a'])

   one  two
d  NaN  4.0
b  2.0  2.0
a  1.0  1.0

In [29]:
pd.DataFrame(d,index=['d','b','a'],columns=['two','three'])

   two three
d  4.0   NaN
b  2.0   NaN
a  1.0   NaN

In [30]:
df['one']

a    1.0
b    2.0
c    3.0
d    NaN
Name: one, dtype: float64

In [31]:
df['three'] = df['one']*df['two']
df['flag'] = df['one']>2
df

   one  two  three   flag
a  1.0  1.0    1.0  False
b  2.0  2.0    4.0  False
c  3.0  3.0    9.0   True
d  NaN  4.0    NaN  False

In [32]:
del df['two']

In [33]:
df

   one  three   flag
a  1.0    1.0  False
b  2.0    4.0  False
c  3.0    9.0   True
d  NaN    NaN  False

In [34]:
df['foo']='bar'

In [35]:
df

   one  three   flag  foo
a  1.0    1.0  False  bar
b  2.0    4.0  False  bar
c  3.0    9.0   True  bar
d  NaN    NaN  False  bar

In [36]:
df['one_trunc']=df['one'][0:2]
df

   one  three   flag  foo  one_trunc
a  1.0    1.0  False  bar        1.0
b  2.0    4.0  False  bar        2.0
c  3.0    9.0   True  bar        NaN
d  NaN    NaN  False  bar        NaN

In [39]:
df = pd.DataFrame(np.random.randn(8,3), columns=list('ABC'))
df

          A         B         C
0  0.461129 -1.101969  3.443375
1  0.091540 -1.099210  0.216027
2  0.711995  0.371053 -0.664427
3  0.797666 -0.894844 -1.393040
4 -0.623300  0.277293 -0.056813
5  0.585080  0.006948 -0.429747
6  0.864508 -0.451985 -0.029739
7  1.908216 -1.300990 -0.506256

In [40]:
df *5 + 2

           A         B          C
0   4.305644 -3.509844  19.216873
1   2.457698 -3.496048   3.080135
2   5.559975  3.855266  -1.322136
3   5.988330 -2.474218  -4.965201
4  -1.116502  3.386467   1.715933
5   4.925402  2.034742  -0.148733
6   6.322538 -0.259927   1.851305
7  11.541082 -4.504949  -0.531282

In [42]:
df1 = pd.DataFrame({'a':[1,0,1], 'b':[0,1,1]}, dtype=bool)
df2 = pd.DataFrame({'a':[0,1,1], 'b':[1,1,0]}, dtype=bool)
df1 & df2

       a      b
0  False  False
1  False   True
2   True  False

In [43]:
df1 | df2

      a     b
0  True  True
1  True  True
2  True  True

In [44]:
df1 ^ df2

       a      b
0   True   True
1   True  False
2  False   True

In [47]:
dft = pd.DataFrame({'A':np.random.rand(3),
                    'B': 1,
                    'C': 'foo',
                    'D': pd.Timestamp('20010102'),
                    'E': pd.Series([1.0]*3).astype('float32'),
                    'F': False,
                    'G': pd.Series([1]*3,dtype='int8')
                   })
dft

          A  B    C          D    E      F  G
0  0.930959  1  foo 2001-01-02  1.0  False  1
1  0.099884  1  foo 2001-01-02  1.0  False  1
2  0.803922  1  foo 2001-01-02  1.0  False  1

In [48]:
dft.dtypes

A           float64
B             int64
C            object
D    datetime64[ns]
E           float32
F              bool
G              int8
dtype: object

In [51]:
df1 = pd.DataFrame(np.random.randn(8,1),columns=['A'], dtype='float32')
df1.dtypes

A    float32
dtype: object

In [52]:
dft1 = pd.DataFrame({'a':[1,0,1],'b':[4,5,6],'c':[7,8,9]})
dft1 = dft1.astype({'a':np.bool, 'c':np.float64})

In [53]:
dft1

       a  b    c
0   True  4  7.0
1  False  5  8.0
2   True  6  9.0

In [54]:
dft1.dtypes

a       bool
b      int64
c    float64
dtype: object